app/controllers/departments_controller.rb

INSERT INTO "departments" ("dept_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["dept_name", "Department 1"], ["description", "It has all the details of employees of department 1."], ["created_at", "2017-03-18 00:49:27.817085"], ["updated_at", "2017-03-18 00:49:27.817085"]]
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save