app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"  ORDER BY salary DESC, department_id LIMIT -1 OFFSET 1
SELECT MAX(age.to_s) FROM "employees"
---
  def index
    @employees = Employee.all

INSERT INTO "employees" ("name", "email", "age", "salary", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Ram"], ["email", "ram@gmail.com"], ["age", 36], ["salary", 100000], ["department_id", 1], ["created_at", "2017-03-18 01:03:18.142161"], ["updated_at", "2017-03-18 01:03:18.142161"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = ?, "email" = ?, "age" = ?, "salary" = ?, "department_id" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Hemanth"], ["email", "hemanth@gmail.com"], ["age", 22], ["salary", 130000], ["department_id", 0], ["updated_at", "2017-03-18 01:00:45.672628"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)