app/controllers/orders_controller.rb

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC LIMIT 1
---
  def highsalary
    @employees = Employee.order(salary: :desc).limit(1)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."age" ASC
---
  def order_by_age_asc
	@employees = Employee.order(:age)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."age" DESC
---
  def order_by_age_desc
	@employees = Employee.order(age: :desc)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."department_id" ASC
---
  def order_by_dept
    @employees = Employee.order(:department_id)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."salary" ASC
---
  def order_by_salary_asc
    @employees = Employee.order(:salary)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC
---
  def order_by_salary_desc
	@employees = Employee.order(salary: :desc)

SELECT "employees".* FROM "employees" WHERE (age > 65)
---
  def retired_list
	@employees = Employee.where("age > ?", 65)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC LIMIT 5
---
  def top5emp
	@employees = Employee.order(salary: :desc).limit(5)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."age" DESC LIMIT 5
---
  def top5sremp_by_age
	@employees = Employee.order(age: :desc).limit(5)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" ASC, "employees"."age" DESC LIMIT 1
---
  def lowsalaryandsenior
	@employees = Employee.order(:salary, age: :desc).limit(1)